{
   "weather_details": {
      "06-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 84,
         "rh_min": 44,
         "wind_speed": 3,
         "wind_direction": 164,
         "cloud_cover": 3
      },
      "07-11-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 18,
         "rh_max": 89,
         "rh_min": 45,
         "wind_speed": 1,
         "wind_direction": 124,
         "cloud_cover": 3
      },
      "08-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 18,
         "rh_max": 91,
         "rh_min": 49,
         "wind_speed": 2,
         "wind_direction": 76,
         "cloud_cover": 4
      },
      "09-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 18,
         "rh_max": 91,
         "rh_min": 47,
         "wind_speed": 2,
         "wind_direction": 112,
         "cloud_cover": 4
      },
      "10-11-2024": {
         "rainfall": 0,
         "t_max": 31,
         "t_min": 17,
         "rh_max": 88,
         "rh_min": 41,
         "wind_speed": 2,
         "wind_direction": 108,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ସୋରିଷ",
      "କପା",
      "ସୂର୍ଯ୍ଯ଼ମୁଖୀ",
      "ବାଇଗଣ",
      "ଲଙ୍କା",
      "ଧାନ।"
   ],
   "general_advisory": "ଆଇଏମଡିରୁ ପ୍ରାପ୍ତ ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନକୁ ଦୃଷ୍ଟିରେ ରଖି, କୃଷକମାନଙ୍କୁ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ନିଡ଼ାଇ, ସାର ପ୍ରଯ଼ୋଗ, ଜଳସେଚନ, ଅମଳ ଏବଂ ଉଦ୍ଭିଦ ସୁରକ୍ଷା ରାସାଯ଼ନିକ ପ୍ରଯ଼ୋଗ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୃଷକମାନଙ୍କୁ ମୁଖ୍ଯ଼ କ୍ଷେତରେ ଲଙ୍କା, ଟମାଟୋ, କ୍ଯ଼ାପ୍ସିକମ୍, ବନ୍ଧାକୋବି, ଫୁଲକୋବି, ବାଇଗଣ ଇତ୍ଯ଼ାଦି ଦିନ ପୁରୁଣା ପନିପରିବା ଚାରା ରୋପଣ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଭୂତାଣୁ ସଂକ୍ରମିତ ଫସଲର ଘାସକୁ ଲଙ୍କା, ଟମାଟୋ ଏବଂ ବାଇଗଣରେ କାଟିବା ଉଚିତ। ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ଉପୁଡ଼ାଇ ମାଟିରେ ପୋତିଦେବା ଉଚିତ। ସୋରିଷ, ସାରସନ୍, ସୂର୍ଯ୍ଯ଼ମୁଖୀ, କ୍ଷେତ ମଟର, ଗାଜର, ମୂଳା ଇତ୍ଯ଼ାଦି ବୁଣିବା ପାଇଁ ବର୍ତ୍ତମାନ ଉପଯୁକ୍ତ ସମଯ଼ | ତେଣୁ କୃଷକମାନଙ୍କୁ ସେହି ଅନୁଯାଯ଼ୀ କାର୍ଯ୍ଯ଼ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଡାଲି/କଳା ଚଣା/ସବୁଜ ଚଣା ଭଳି ଡାଲି ଗୁଡ଼ିକୁ ଅମଳ କରିବାର ଏକ ସପ୍ତାହ ପୂର୍ବରୁ ଠିଆ ହୋଇଥିବା ପରିପକ୍ୱ ଫସଲ (ଧାନ) ରେ ପ୍ରସାରଣ କରାଯାଇପାରିବ, ଯାହାଦ୍ୱାରା ଉପଯୁକ୍ତ ଅଞ୍ଚଳରେ ମାଟିରେ ଅବଶିଷ୍ଟ ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରାଯାଇପାରିବ। ସୋରିଷ ବୁଣିବା ପୂର୍ବରୁ ଏକର ପିଛା 20-25 କେଜି ଡିଏପି + 10 କେଜି ଏମଓପିକୁ ଆଧାର ଭାବେ ଲଗାନ୍ତୁ।",
   "crops_data": {
      "mustard": {
         "advisory": [
            "ନଭେମ୍ବରର ପ୍ରଥମ ପନ୍ଦର ଦିନ ମଧ୍ଯ଼ରେ ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ବୀଜ ବୁଣିବା ପୂର୍ବରୁ ଥିରମ୍ @2.5g/kg କିମ୍ବା ବାଭିଷ୍ଟିନ୍ @2 ଗ୍ରାମ୍/କେଜି ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ସୋରିଷ <ଆଇ. ଡି. 2> କି. ଗ୍ରା./ଏକର ଏବଂ <ଆଇ. ଡି. 1> କି. ଗ୍ରା./ଏକର ପାଇଁ ବିହନ ଦର ତୋରିଆ ପାଇଁ ଉଦ୍ଦିଷ୍ଟ। ଉପଯୁକ୍ତ କିସମଃ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜଯ଼କିସାନ, ଜେଡି-6। ତୋରିଆ-ଏମ୍ 29, ଅନୁରାଧା, ପାର୍ବତୀ। ପୋଷକ ତତ୍ତ୍ୱ ପରିଚାଳନାଃ ପ୍ରଥମ ଜଳସେଚନ ପୂର୍ବରୁ ଏକର ପିଛା 20-25 କେଜି ଡିଏପି + 10 କେଜି ଏମଓପିକୁ ଆଧାର ଭାବେ ଏବଂ 35-40 କେଜି ଯ଼ୁରିଆ + 5 କେଜି ଏମଓପି/ଏକର ଭାବେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cotton": {
         "advisory": [
            "ଯେତେବେଳେ ବୋଲ୍ ଗୁଡ଼ିକ ସମ୍ପୂର୍ଣ୍ଣ ଭାବେ ଫୁଟିଯାଏ, ସେତେବେଳେ ଉଠାଇବା ଉଚିତ। ଆର୍ଦ୍ରତାକୁ 8-10% କୁ ହ୍ରାସ କରିବା ପାଇଁ କଂକ୍ରିଟ୍ ଚଟାଣ କିମ୍ବା ତିରପାଲ ଶୀଟ୍ ଉପରେ ବୀଜ କପଡ଼ାକୁ ଶୁଖାଇ ଦିଅନ୍ତୁ | ଭଲ ମୂଲ୍ଯ଼ ପାଇବା ପାଇଁ ପ୍ରଥମ ଉଠାଣରୁ ମିଳିଥିବା ବିହନ କପଡ଼ାକୁ ଅଲଗା ଭାବେ ରଖନ୍ତୁ। ଉତ୍ତମ ଉଦ୍ଭିଦ ବୃଦ୍ଧି ଏବଂ ଶୁଣ୍ଢ ବିକାଶ ପାଇଁ ଏନ. ପି. କେ.-<ଆଇ. ଡି. 1> ପରି ତରଳ ସାରର ପତ୍ର ସ୍ପ୍ରେ 20 ଗ୍ରାମ୍/10 ଲିଟର ପାଣିରେ କରାଯିବା ଉଚିତ। କୌଣସି ନୂତନ କୀଟପତଙ୍ଗ ଏବଂ ରୋଗର ଘଟଣା ବିଷଯ଼ରେ ଜାଣିବା ପାଇଁ ଫସଲର ନିଯ଼ମିତ ତଦାରଖ।"
         ]
      },
      "sunflower": {
         "advisory": [
            "ନଭେମ୍ବର ମଧ୍ଯ଼ଭାଗ ସୁଦ୍ଧା ବୁଣିବା ଶେଷ ହେବା ଉଚିତ। ବୁଣିବା ପୂର୍ବରୁ ଭିଟାବ୍ଯ଼ାକ୍ସ ପାୱାର (କାର୍ବୋକ୍ସିନ + ଥିରାମ) @2.5g/kg କିମ୍ବା ମେଟାଲ୍ଯ଼ାକ୍ସିଲ @5 ଗ୍ରାମ/କିଲୋଗ୍ରାମ ମଞ୍ଜି ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବୀଜ ହାରଃ ଇନବ୍ରେଡ୍-4କେଜି/ଏସି ଏବଂ ହାଇବ୍ରିଡ୍-2କେଜି/ଏସି। ଉପଯୁକ୍ତ କିସମଃ ଇନବ୍ରେଡ୍-ଆଧୁନିକ, ଟି. ଏନ୍. ଏ. ଯ଼ୁ. ଏସ୍. ଯ଼ୁ. ଏଫ୍.-7, ଡି. ଆର୍. ଏସ୍. ଏଫ୍.-108 (90 ଦିନ), ହାଇବ୍ରିଡ୍-ପିଏସି 36, କେ. ବି. ଏସ୍. ଏଚ୍. 1, ଏମ୍. ଏସ୍. ଏଫ୍. ଏଚ୍. 8, ଏମ୍. ଏସ୍. ଏଫ୍. ଏଚ୍. 17 (95-110 ଦିନ)"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଛେଦକ କୀଟ ଉପରେ ନଜର ରଖିବା ପାଇଁ, କୃଷକମାନଙ୍କୁ ଏକର ପିଛା 8 ହାରରେ ଫେରୋମୋନ୍ ଫାନ୍ଦ ବ୍ଯ଼ବହାର କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ସ୍ପିନୋସାଦ୍ 45 ପ୍ରତିଶତ ଏସ୍. ସି. @1.5 ମିଲି/4 ଲିଟର ପାଣି କିମ୍ବା ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ୍/10 ଲିଟର ପାଣି କିମ୍ବା ଥିଓଡିକାର୍ବ 75 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ମିଲି/ଲିଟର ପାଣି ସିଞ୍ଚନ କରନ୍ତୁ।"
         ]
      },
      "chilli": {
         "advisory": [
            "ଥ୍ରୀପ୍ସର ସଂକ୍ରମଣ ପରିଲକ୍ଷିତ ହୋଇଛି। ଯଦି ପତ୍ରଗୁଡ଼ିକ ଉପରକୁ ଘୁଞ୍ଚିଯାଏ ତେବେ ଗଛଗୁଡ଼ିକ ଥ୍ରୀପ୍ ଦ୍ୱାରା ପ୍ରଭାବିତ ହୁଅନ୍ତି | ଥ୍ରିପ୍ସ ସଂକ୍ରମଣକୁ ପରିଚାଳନା କରିବା ପାଇଁ ବ୍ଲୁ ଷ୍ଟିକି ଟ୍ରାପ୍ @8 nos./acre ସ୍ଥାପନ କରନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଇମାମେକ୍ଟିନ୍ ବେନ୍ଜୋଏଟ୍ 5 ପ୍ରତିଶତ ଏସ୍. ଜି. @4 ଗ୍ରାମ/ଲିଟର କିମ୍ବା ଫିପ୍ରୋନିଲ୍ 5 ପ୍ରତିଶତ ଏସ୍. ସି. @2 ମିଲି/ଲିଟର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. 0.35 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "paddy": {
         "advisory": [
            "ଶୀଘ୍ର ପରିପକ୍ୱ ହେଉଥିବା କିସମଗୁଡ଼ିକରେ, ଫସଲ ଅମଳ କରନ୍ତୁ ଯେତେବେଳେ 80-85% ଶସ୍ଯ଼ ହାତ ଦ୍ୱାରା ହାତୁଡ଼ି ଦ୍ୱାରା କିମ୍ବା କମ୍ବାଇନ୍ ହାରଭେଷ୍ଟର କିମ୍ବା ରିପ୍ପର୍ ବ୍ଯ଼ବହାର କରି ପରିପକ୍ୱ ହୁଏ | ବ୍ଯ଼ବହାର ଉଦ୍ଦେଶ୍ଯ଼ରେ ଧାନ ଶସ୍ଯ଼କୁ 14 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ସୂର୍ଯ୍ଯ଼ାଲୋକରେ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ ଏବଂ ଉନ୍ନତ ସ୍ୱଯ଼ଂ-ଜୀବନ ପାଇଁ ବୀଜ ଉଦ୍ଦେଶ୍ଯ଼ରେ ଏହାକୁ 12 ପ୍ରତିଶତ ଆର୍ଦ୍ରତା ପର୍ଯ୍ଯ଼ନ୍ତ ଶୁଖାଇବା ଆବଶ୍ଯ଼କ। କୀଟ ପରିଚାଳନାଃ ଗୁଣ୍ଡି ବଗଃ ପ୍ରଚଳିତ ପାଣିପାଗ ସ୍ଥିତିରେ, ଗୁଣ୍ଡି ବଗ୍ର ସଂକ୍ରମଣ କ୍ଷୀର ଦୋଇବା ସମଯ଼ରେ ଲକ୍ଷ୍ଯ଼ କରାଯାଇପାରେ। ଯଦି 2 ରୁ ଅଧିକ ବଯ଼ସ୍କ/ପାହାଡ ଦେଖାଯାଏ, କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @400 ମିଲି କିମ୍ବା କ୍ଲୋରୋପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ 06 ପ୍ରତିଶତ + ଲାମ୍ବଡା-ସାଇହାଲୋଥ୍ରିନ୍ 04 ପ୍ରତିଶତ ଏସଏଲ @120 ମିଲି/ଏକର 200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରିତ ପତ୍ର ସ୍ପ୍ରେ ଭାବରେ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "05-11-2024"
}