{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 90.4,
         "rh_min": 67.6,
         "wind_speed": 3,
         "wind_direction": 346,
         "cloud_cover": 6
      },
      "31/10/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 88.8,
         "rh_min": 60.4,
         "wind_speed": 4,
         "wind_direction": 241,
         "cloud_cover": 6
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 87.8,
         "rh_min": 66.7,
         "wind_speed": 6,
         "wind_direction": 243,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ଯ଼ମୁଖୀ",
      "ଦେବୀ",
      "କାଦରୀ-6",
      "କାଦରୀ-9",
      "ଟିଜି-37ଏ",
      "ଟ୍ଯ଼ାଗ-51",
      "ଟ୍ଯ଼ାଗ୍-38",
      "ଟ୍ଯ଼ାଗ୍-24",
      "ସ୍ମୃତି"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ଯ଼ମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଗହମ, କଳା ଗହମ, ମଟର, ମଟର, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଭଳି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ମଧ୍ଯ଼ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଫୁଲ ଫୁଟିବା ଠାରୁ ଆରମ୍ଭ କରି ଧାନର ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ ପର୍ଯ୍ଯ଼ନ୍ତ, ଉପଯୁକ୍ତ କୀଟନାଶକ ଦ୍ୱାରା କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟରପିଲରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।",
            "ଧାନ କ୍ଷେତରେ ଉପଯୁକ୍ତ କୀଟନାଶକ ସିଞ୍ଚନ କରି ଗୁଣ୍ଡି ବଗ୍କୁ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଶାରୀରିକ ପରିପକ୍ୱତା/ଅମଳ ପର୍ଯ୍ୟାୟରେ, ଚିନାବାଦାମକୁ ପଲିଥିନ୍-ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ୟାଗରେ ଡେସିକାଣ୍ଟ ସହିତ ଗଚ୍ଛିତ ରଖନ୍ତୁ |",
            "ଚିନାବାଦାମରେ ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ପରିଚାଳନା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ରାସାଯ଼ନିକ ପଦାର୍ଥ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପରିପକ୍ୱତା ପର୍ଯ୍ୟାୟରେ ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ସାପ୍ତାହିକ ବ୍ୟବଧାନରେ ଟ୍ରାଇକୋଗ୍ରାମ୍ମା ଚିଲୋନିସ୍ କାର୍ଡକୁ ବିଭକ୍ତ କରନ୍ତୁ।",
            "ଛିଦ୍ରକ ପରିଚାଳନା ପାଇଁ ଫିପ୍ରୋନିଲ କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ ଭଳି ସୁପାରିସ କରାଯାଇଥିବା ରାସାଯ଼ନିକ ପଦାର୍ଥ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଉପଯୁକ୍ତ ରାସାଯ଼ନିକ ପଦାର୍ଥ ସହିତ ପ୍ରସ୍ତୁତ ବିଷାକ୍ତ ବିଟ୍ ବ୍ଯ଼ବହାର କରି କାକୁଡ଼ିରେ ଫଳ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ |"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି ପାଇଁ, ସୁସ୍ଥ ବୃଦ୍ଧି ସୁନିଶ୍ଚିତ କରିବା ପାଇଁ ସାରକୁ ସଠିକ୍ ଭାବରେ ପରିଚାଳନା କରନ୍ତୁ |"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ରୋଜରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରଭାବଶାଳୀ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଉପଯୁକ୍ତ ରାସାଯ଼ନିକ ସ୍ପ୍ରେ କରନ୍ତୁ |"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିୟମିତ ତଥ୍ୟ ମିଳୁନାହିଁ।"
}