{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 90.4,
         "rh_min": 67.6,
         "wind_speed": 3,
         "wind_direction": 346,
         "cloud_cover": 6
      },
      "31/10/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 88.8,
         "rh_min": 60.4,
         "wind_speed": 4,
         "wind_direction": 241,
         "cloud_cover": 6
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 87.8,
         "rh_min": 66.7,
         "wind_speed": 6,
         "wind_direction": 243,
         "cloud_cover": 6
      }
   },
   "names_of_crops": [
      "green gram",
      "black gram",
      "cowpea",
      "field pea",
      "lentil",
      "groundnut",
      "toria",
      "sunflower",
      "devi",
      "kadri-6",
      "kadri-9",
      "tg-37a",
      "tag-51",
      "tag-38",
      "tag-24",
      "smruti"
   ],
   "general_advisory": "Farmers are advised to grow short duration Rabi crops like green gram, black gram, cowpea, field pea, lentil, groundnut, toria, and sunflower in medium/shallow lowlands utilizing the available soil moisture in the field. Farmers are also advised to visit their crop fields regularly to check pest infestation.",
   "crops_data": {
      "paddy": {
         "advisory": [
            "For flowering to physiological maturity stage of paddy, control Ear Head Caterpillar with suitable pesticides.",
            "Manage Gundhi Bug in paddy fields by spraying appropriate insecticides."
         ]
      },
      "groundnut": {
         "advisory": [
            "During physiological maturity/harvesting stage, store groundnut in polythene-lined gunny bags with desiccants.",
            "Apply recommended chemicals for internode borer management in groundnut."
         ]
      },
      "sugarcane": {
         "advisory": [
            "To manage internode borer during ripening stage, split Trichogramma chilonis cards at weekly intervals.",
            "Spray recommended chemicals like Fipronil or Chlorantraniliprole for borer management."
         ]
      },
      "cucurbits": {
         "advisory": [
            "Control fruit fly in cucurbits using poison baits prepared with appropriate chemicals."
         ]
      },
      "cole crop": {
         "advisory": [
            "For cauliflower and cabbage, manage fertilizers properly to ensure healthy growth."
         ]
      },
      "marigold & rose": {
         "advisory": [
            "To manage Red Spider Mites in Marigold and Rose, spray suitable chemicals for effective control."
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "Not getting consistent data."
}