{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 8,
         "t_max": 34,
         "t_min": 27,
         "rh_max": 92.9,
         "rh_min": 68.5,
         "wind_speed": 4,
         "wind_direction": 11.3,
         "cloud_cover": 8
      },
      "31/10/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 91,
         "rh_min": 58.1,
         "wind_speed": 5,
         "wind_direction": 256,
         "cloud_cover": 7
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 24,
         "rh_max": 90.5,
         "rh_min": 58.1,
         "wind_speed": 3,
         "wind_direction": 320.7,
         "cloud_cover": 7
      }
   },
   "names_of_crops": [
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ଯ଼ମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ଫିଲ୍ଡ ମଟର, ମସୁର ଡାଲି, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ଯ଼ମୁଖୀ ପରି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଦେବୀ (ଆଇ. ସି. ଜି. ଭି.-91114), କାଦ୍ରି-6, କାଦ୍ରି-9, ଟି. ଜି.-50 ଭଳି ଓଡ଼ିଶା ପାଇଁ ଉପଯୁକ୍ତ ଚିନାବାଦାମ କିସମ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଏକ ଏକର ପାଇଁ, 40-50 କିଲୋଗ୍ରାମ ଚିନାବାଦାମ ମଞ୍ଜି ଦାନ୍ତ ଆବଶ୍ଯ଼କ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "PADDY: ଫୁଲକୁ ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ରେ ପହଞ୍ଚାଇବା-କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟର୍ପିଲରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଆଚରଣରେ କୀଟପତଙ୍ଗ ନିଶାଚର ହୋଇଥିବାରୁ ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ଯ଼ାରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।-ଗୁଣ୍ଡି ବଗ ସ୍ପ୍ରେ କ୍ଲୋରପିରିଫସ୍ କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 400 ମିଲିଲିଟରରେ 20 ପ୍ରତିଶତ ଇ. ସି. କ୍ଲୋରପିରିଫସ୍ର ଧୂଳି ପୋଛିବା 1.5% ଡି @10 କି. ଗ୍ରା./ଏକର କିମ୍ବା ମାଲାଥିଅନ୍ 5% ଡି. ପି. @10 କି. ଗ୍ରା./ଏକର ସକାଳ ସମଯ଼ରେ ସମାନ ଭାବରେ କରାଯିବା ଉଚିତ, ଯେତେବେଳେ କୌଣସି କିମ୍ବା ସର୍ବନିମ୍ନ ପବନ ନଥାଏ।"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଗ୍ରାଉଣ୍ଡନଟ୍ଃ ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼/ଅମଳ ପର୍ଯ୍ଯ଼ାଯ଼-ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10 ଲିଟର ପାଣିରେ ମିଶ୍ରିତ 10 ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ଦ୍ରବଣ ସହିତ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ସୁଗାରକେନ୍ଃ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼-ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ମ୍ଯ଼ାନେଜମେଣ୍ଟ-କୀଟ ଜୈବିକ ପରିଚାଳନା ପାଇଁ, ପ୍ରଦତ୍ତ ଛିଦ୍ରରେ ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ଯ଼ବଧାନରେ 6 ଥର ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ @1/ଏକର ବ୍ଯ଼ବହାର କରନ୍ତୁ। ରାସାଯ଼ନିକ ଭାବରେ କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଏକର ପିଛା 600 ମିଲି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କେଜି ସ୍ପ୍ରେ କରନ୍ତୁ। 8 କିଲୋଗ୍ରାମ ବାଲି ସହିତ ମିଶ୍ରଣ କରି କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କିଲୋଗ୍ରାମ/ଏକର ପ୍ରଯ଼ୋଗ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "କୁକୁଡ଼ାଃ ଫଳ ଦେବା ପାଇଁ ଉଦ୍ଭିଦ-ଫଳ ମାଛି-କୁକୁଡ଼ାରେ ଫଳ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400 ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8 ମିଲି ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ର @80 ନମ୍ବର/ଏକରରେ ରଖନ୍ତୁ। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ଯ଼ୁବରଣ କରିବେ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ସି. ଓ. ଏଲ୍. ଇ. କ୍ରପ୍ (ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି): ଉଦ୍ଭିଜ୍ଜ ପର୍ଯ୍ଯ଼ାଯ଼-ସାର ପରିଚାଳନା-ଏକର ପିଛା 20 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ ହାତ କାଟିବା ପରେ <ଆଇ. ଡି. 2> ଡି. ଏ. ଟି. ଏବଂ 33 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ ଏକର ପିଛା 23 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଯଦି ଚାରା ରୋପଣ ସମଯ଼ରେ ବୋରାକ୍ସ ପ୍ରଯ଼ୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ @4 କିଲୋଗ୍ରାମ/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ଯ଼ୁବର @1.5 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ରୋଜ୍-ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ୱେଟେବଲ୍ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. (ସଲଫେକ୍ସ/ବଲୱାନ୍/ସଲଫାଡେକ୍ସ) ଲିଟର ପିଛା 2 ଗ୍ରାମ କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇ. ସି. (ଓମାଇଟ୍/ମାଇଟ୍କିଲ୍/ସୁପର ଡାଇନାମାଇଟ୍) ଲିଟର ପିଛା 2 ମିଲି. ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇ. ସି. (ସିଗେଟ/ମିଟିଗେଟ/ଫର୍ମାଇଟ୍) ଲିଟର ପିଛା 2 ମିଲି. ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024",
   "ERROR": "ନିୟମିତ ତଥ୍ୟ ମିଳୁନାହିଁ।"
}