{
   "weather_details": {
      "03/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 57,
         "rh_min": 13,
         "wind_speed": 12,
         "wind_direction": 205,
         "cloud_cover": 0
      },
      "04/04/2024": {
         "rainfall": 0,
         "t_max": 40,
         "t_min": 26,
         "rh_max": 80,
         "rh_min": 15,
         "wind_speed": 11,
         "wind_direction": 180,
         "cloud_cover": 1
      },
      "05/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 70,
         "rh_min": 23,
         "wind_speed": 15,
         "wind_direction": 207,
         "cloud_cover": 1
      },
      "06/04/2024": {
         "rainfall": 0,
         "t_max": 41,
         "t_min": 27,
         "rh_max": 67,
         "rh_min": 15,
         "wind_speed": 13,
         "wind_direction": 210,
         "cloud_cover": 0
      },
      "07/04/2024": {
         "rainfall": 0,
         "t_max": 42,
         "t_min": 27,
         "rh_max": 55,
         "rh_min": 10,
         "wind_speed": 12,
         "wind_direction": 242,
         "cloud_cover": 2
      }
   },
   "names_of_crops": [
      "ଧାନ।",
      "ଆଖୁ",
      "ମକା",
      "ଟମାଟୋ",
      "ବାଇଗଣ",
      "ନଡ଼ିଆ",
      "ପନିପରିବା",
      "କଳା ଚଣା",
      "ସବୁଜ ଚଣା",
      "ଓକ୍ରା",
      "ରସୁଣ",
      "ଆମ୍ବ"
   ],
   "general_advisory": "ଧାନ ଫସଲରେ, ପେନିକଲ୍ ଦୀକ୍ଷା, ପେନିକଲ୍ ଉତ୍ଥାନ, ଫୁଲ ଏବଂ କ୍ଷୀର ଦୋଇବା ପର୍ଯ୍ୟାୟ ହେଉଛି ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ୟାୟ | ଆଖୁରେ ଶୁଖିଲା ପତ୍ରରେ ଧାଡ଼ିଗୁଡ଼ିକୁ ଢାଙ୍କି ଦିଅନ୍ତୁ। ଉତ୍ତାପ ପ୍ରଭାବକୁ ହ୍ରାସ କରିବା ପାଇଁ ସ୍ପ୍ରିଂକଲର ଜଳସେଚନ ପ୍ରୟୋଗ କରନ୍ତୁ। ଅଧିକ ତାପମାତ୍ରା ମକା ଫସଲର ଜଳର ଆବଶ୍ୟକତାକୁ ବଢ଼ାଇଥାଏ। ଜଳ ଅପଚୟକୁ ରୋକିବା ପାଇଁ ଜଳସେଚନ ଚ୍ୟାନେଲରେ ପଲିଥିନ୍ ବିସ୍ତାର କରନ୍ତୁ। ଜଳକ୍ଷୟ ହ୍ରାସ କରିବା ପାଇଁ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ। ଯଦି ଜଳର ତାପମାତ୍ରା ବୃଦ୍ଧି ପାଏ, ତେବେ ଅଗଭୀର ପୋଖରୀରେ ଫିଙ୍ଗରଲିଂ ଅମଳ କରନ୍ତୁ। ଉନ୍ନତ କୃଷି ଲାଭ ପାଇଁ, ଓୟୁଏଟି କାଲିଙ୍ଗା ଉତ୍ପାଦ ବ୍ୟବହାର କରନ୍ତୁ।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଗୁରୁତ୍ୱପୂର୍ଣ୍ଣ ପର୍ଯ୍ଯ଼ାଯ଼ରେ ଜଳର ଅଭାବ ଉତ୍ପାଦନ ହ୍ରାସ କରିଥାଏ।"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପାଣି ଅଭାବରୁ ରକ୍ଷା ପାଇବା ପାଇଁ ପୋଟାସିଯ଼ମ୍ ସହିତ ଉପର ପୋଷାକ ପିନ୍ଧନ୍ତୁ |"
         ]
      },
      "maize": {
         "advisory": [
            "ବର୍ଦ୍ଧିତ ଜଳ ଆବଶ୍ଯ଼କତାକୁ ପୂରଣ କରିବା ପାଇଁ ଫସଲକୁ ଜଳସେଚନ କରନ୍ତୁ।"
         ]
      },
      "tomato": {
         "advisory": [
            "ଶୁଷ୍କତାକୁ ରୋକିବା ପାଇଁ ମୂଳ ଅଞ୍ଚଳରେ ସ୍ଟ୍ରେପ୍ଟୋସାଇକ୍ଲିନ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "brinjal": {
         "advisory": [
            "ଶୁଟ୍ ଏବଂ ଫଳ ଛେଦକ ପରିଚାଳନା ପାଇଁ ଫେରୋମୋନ୍ ଟ୍ରାପ୍ ସ୍ଥାପନ କରନ୍ତୁ |",
            "କୀଟ ସଂକ୍ରମଣ ସମଯ଼ରେ ନିମ-ଆଧାରିତ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସହିତ ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ବ୍ଯ଼ବହାର କରନ୍ତୁ।"
         ]
      },
      "coconut": {
         "advisory": [
            "ଜଳକ୍ଷଯ଼ ହ୍ରାସ କରିବା ପାଇଁ ଗଛ ଚାରିପାଖରେ ନଡ଼ିଆ ପତ୍ରକୁ ମଲ୍ଚ କରନ୍ତୁ।"
         ]
      },
      "vegetables": {
         "advisory": [
            "ଦିନରେ ନୂତନ ରୋପଣ କରାଯାଇଥିବା ଚାରା ଗୁଡ଼ିକୁ କାଗଜ ଟୋପି ଦ୍ୱାରା ଢାଙ୍କି ଦିଅନ୍ତୁ।"
         ]
      },
      "black gram": {
         "advisory": [
            "ତମାଖୁ କ୍ଯ଼ାଟର୍ପିଲର ସ୍ଥାନାନ୍ତରଣ ପାଇଁ ଯାଞ୍ଚ କରନ୍ତୁ ଏବଂ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ |"
         ]
      },
      "green gram": {
         "advisory": [
            "ତମାଖୁ କ୍ୟାଟର୍ପିଲର ସ୍ଥାନାନ୍ତରଣ ପାଇଁ ଯାଞ୍ଚ କରନ୍ତୁ ଏବଂ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ପ୍ରୟୋଗ କରନ୍ତୁ |"
         ]
      },
      "okra": {
         "advisory": [
            "ଶ୍ୱେତ ମାଛି ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ ସହିତ ମଞ୍ଜି ଚିକିତ୍ସା କରନ୍ତୁ |",
            "ଶୀଘ୍ର ଚିହ୍ନଟ ପାଇଁ ହଳଦିଆ ଚଟପଟା ଜାଲ ଲଗାନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଅମଳ ପରେ ଉପର ଭାଗକୁ କାଟନ୍ତୁ ଏବଂ ସଂରକ୍ଷଣ ପାଇଁ କନ୍ଦକୁ ଭଲ ଭାବେ ଶୁଖାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "mango": {
         "advisory": [
            "ଆମ୍ବ ହପରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିର୍ଦ୍ଦିଷ୍ଟ କୀଟନାଶକ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "02-04-2024"
}