{
   "weather_details": {
      "05.11.2024": {
         "rainfall": 0,
         "t_max": 30,
         "t_min": 23,
         "rh_max": 85,
         "rh_min": 65,
         "wind_speed": 10,
         "wind_direction": 240,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଆଖୁ",
      "ରସୁଣ",
      "ଫ୍ରେଞ୍ଚ ବିନ୍",
      "ଆଳୁ ଓ ଫୁଲକୋବି",
      "ଆଳୁ",
      "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ",
      "ମତ୍ସ୍ଯ଼ଚାଷ",
      "ପଶୁପାଳନ"
   ],
   "general_advisory": "ଉନ୍ନତ କୃଷି ଲାଭ ପାଇଁ, ଓୟୁଏଟି କାଲିଙ୍ଗା ଉତ୍ପାଦ ବ୍ୟବହାର କରନ୍ତୁ। ପଶୁମାନଙ୍କୁ ନିୟମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ୟକତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ୟ, ଗୁଡ଼ ଇତ୍ୟାଦି ଯୋଗାଇ ଦିଆଯାଇପାରେ |",
   "crops_data": {
      "sugarcane": {
         "advisory": [
            "ସ୍କେଲ୍ କୀଟ ସଂକ୍ରମଣକୁ ରୋକିବା ପାଇଁ ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ଯ଼ବଧାନରେ 6 ଥର ପାଇଁ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ @1-2/ଏକର ବ୍ଯ଼ବହାର କରନ୍ତୁ।",
            "200 ଲିଟର ପାଣି ସହିତ ମିଶ୍ରଣ କରି ଏକର ପିଛା 1 କି. ଗ୍ରା. ରେ ମେଟାରିଜିଯ଼ମ୍ ଆନିସୋପିଲା ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ, ଥିଯ଼ାମେଥୋକ୍ସାମ୍ 25 ପ୍ରତିଶତ ଡବ୍ଲୁ. ଜି. @60 ଗ୍ରାମ୍/ଏକର କିମ୍ବା ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ <ଆଇ. ଡି. 1> ଏସ୍. ଏଲ୍. @60 ମିଲି/ଏକର କିମ୍ବା ଏସିଟାମିପ୍ରିଡ୍ 20 ପ୍ରତିଶତ ଏସ୍. ପି. <ଆଇ. ଡି. 2> ଏକରକୁ 200 ଲିଟର ପାଣି ସହିତ ମିଶାଇ ଲଗାନ୍ତୁ।"
         ]
      },
      "onion": {
         "advisory": [
            "ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଲାଇଟ୍ ରେଡ୍, ଅଗ୍ରିଫାଉଣ୍ଡ୍ ଡାର୍କ ରେଡ୍, ଭୀମ ଶକ୍ତି, ଭୀମ ସୁପର୍ ଇତ୍ଯ଼ାଦି ପିଆଜର କିସମ ଶୀତ ଋତୁରେ ଓଡ଼ିଶା ପରିସ୍ଥିତି ପାଇଁ ଉପଯୁକ୍ତ |"
         ]
      },
      "french bean": {
         "advisory": [
            "ଫ୍ରେଞ୍ଚ ବିନ୍ ଚାଷ ପାଇଁ, ବୁଶ୍ କିସମ ପାଇଁ 20-30 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଏବଂ ଲମ୍ବା କିସମ ପାଇଁ 10-12 କିଲୋଗ୍ରାମ ମଞ୍ଜି ଏକର ପିଛା ଆବଶ୍ୟକ। ବୁଣିବା 7 ଦିନ ପୂର୍ବରୁ, ପ୍ରତି କିଲୋଗ୍ରାମ ମଞ୍ଜି ପିଛା 2 ଗ୍ରାମ୍ କାର୍ବେନଡାଜିମ୍ କିମ୍ବା କାର୍ବୋକ୍ସିନ୍ 37.5% + ଥିରମ୍ 37.5% @2 ଗ୍ରାମ୍ ଦେଇ ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "cabbage & cauliflower": {
         "advisory": [
            "ପ୍ରାରମ୍ଭିକ ପରିପକ୍ୱତା କିସମଗୁଡ଼ିକ ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ ଦୂରତା 60 ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ଯ଼ରେ ଦୂରତା 30 ସେ. ମି. ରଖାଯାଇଥିବା ବେଳେ ମଧ୍ଯ଼ମ ଏବଂ ବିଳମ୍ବ ଅବଧି କିସମଗୁଡ଼ିକ ପାଇଁ ଧାଡ଼ି ଠାରୁ ଧାଡ଼ି ମଧ୍ଯ଼ରେ ଦୂରତା <ଆଇ. ଡି. 1> ସେ. ମି. ଏବଂ ଗଛରୁ ଗଛ ମଧ୍ଯ଼ରେ ଦୂରତା <ଆଇ. ଡି. 2> ସେ. ମି. ରଖାଯାଇଥାଏ। ମଧ୍ଯ଼ାହ୍ନ ସମଯ଼ରେ ଚାରା ରୋପଣ କରାଯିବା ଉଚିତ।"
         ]
      },
      "potato": {
         "advisory": [
            "ଚାରା ଲଗାଇବା ପୂର୍ବରୁ ମଞ୍ଜି ଗୁଡ଼ିକୁ ଚିକିତ୍ସା କରନ୍ତୁ। କନ୍ଦ ମଞ୍ଜି ଉପଚାର ପାଇଁ, 100 ଲିଟର ପାଣିରେ 600 ଗ୍ରାମ କାର୍ବେନଡାଜିମ୍ 25 ପ୍ରତିଶତ + ମାନକୋଜେବ୍ 50 ପ୍ରତିଶତ ୱାସ୍ ମିଶାଇ ଏକ ଦ୍ରବଣ ତିଆରି କରନ୍ତୁ। ଏହି ଦ୍ରବଣରେ ଏକ କ୍ୱିଣ୍ଟାଲ୍ କନ୍ଦ ମଞ୍ଜି 20-25 ମିନିଟ୍ ପାଇଁ ବୁଡ଼ାଇ ଦିଅନ୍ତୁ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ରୋଜରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇସି @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "fisheries": {
         "advisory": [
            "ଶୀତ ଋତୁରେ, ମାଛରେ ବିଭିନ୍ନ ଫଙ୍ଗଲ୍, ବ୍ଯ଼ାକ୍ଟେରିଆ ଏବଂ ପରଜୀବୀ ରୋଗ ଦେଖାଯାଇପାରେ | ଶୀତ ଋତୁ ଆରମ୍ଭ ହେବାର ଠିକ୍ ପୂର୍ବରୁ ପୋଖରୀକୁ ସିଫାକ୍ସ @400 ମିଲି/ଏକରରେ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ପୋଖରୀରେ ପୋଟାସିଯ଼ମ୍ ପର୍ମାଙ୍ଗାନେଟ୍ ପ୍ରତି ଏକର ପିଛା 1 ରୁ 2 କି. ଗ୍ରା. କିମ୍ବା ଚୂନପଥର ପ୍ରତି ଏକର ପିଛା 1 ରୁ 1 କି. ଗ୍ରା. ବ୍ଯ଼ବହାର କରନ୍ତୁ। ଏକର ପିଛା 100 କିଲୋଗ୍ରାମ ଲବଣ ପ୍ରଯ଼ୋଗ ମଧ୍ଯ଼ ଶୀତ ଋତୁରେ ମାଛମାନଙ୍କୁ ରୋଗ ପ୍ରାଦୁର୍ଭାବରୁ ରକ୍ଷା କରିବାରେ ସାହାଯ୍ଯ଼ କରିଥାଏ।"
         ]
      },
      "animal husbandry": {
         "advisory": [
            "ପଶୁମାନଙ୍କୁ ନିୟମିତ ଭାବରେ ଲୁଣ ସହିତ ଖଣିଜ ମିଶ୍ରଣ ଦିଆଯିବା ଉଚିତ ଏବଂ ପଶୁମାନଙ୍କ ଶକ୍ତି ଆବଶ୍ୟକତାକୁ ପୂରଣ କରିବା ପାଇଁ ଶୀତ ଋତୁରେ ଦୈନିକ ରାସନରେ ଗହମ ଶସ୍ୟ, ଗୁଡ଼ ଇତ୍ୟାଦି @10%-20% ଯୋଗାଇ ଦିଆଯାଇପାରେ |"
         ]
      }
   },
   "date": "05-11-2024"
}