{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 7,
         "t_max": 31,
         "t_min": 20,
         "rh_max": 96,
         "rh_min": 63,
         "wind_speed": 2,
         "wind_direction": 225,
         "cloud_cover": 7
      },
      "31-10-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 20,
         "rh_max": 96,
         "rh_min": 61,
         "wind_speed": 1,
         "wind_direction": 90,
         "cloud_cover": 6
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 32,
         "t_min": 19,
         "rh_max": 97,
         "rh_min": 58,
         "wind_speed": 1,
         "wind_direction": 243,
         "cloud_cover": 6
      },
      "02-11-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 19,
         "rh_max": 95,
         "rh_min": 52,
         "wind_speed": 0,
         "wind_direction": 90,
         "cloud_cover": 5
      },
      "03-11-2024": {
         "rainfall": 1,
         "t_max": 31,
         "t_min": 19,
         "rh_max": 93,
         "rh_min": 49,
         "wind_speed": 2,
         "wind_direction": 0,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଡାଲିଗୁଡ଼ିକ",
      "ସୋରିଷ",
      "ହଳଦୀ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଅଦା।",
      "ଗାଈ।",
      "ମଇଁଷି।"
   ],
   "general_advisory": "ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ, ଅମଳ ଜାରି ରଖନ୍ତୁ ଏବଂ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରନ୍ତୁ ଏବଂ ସ୍ୱଚ୍ଛ ପାଗ ସମଯ଼ରେ ପରିପକ୍ୱ ଚାରା ରୋପଣ କରନ୍ତୁ। କୀଟପତଙ୍ଗ ପାଇଁ ନିଯ଼ମିତ ନିରୀକ୍ଷଣ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ (ବିମ୍) @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି ଲଗାନ୍ତୁ।",
            "ବାଷ୍ପ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଓଫସ୍/ପ୍ରୋଫେନୋଫସ୍ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବି. ପି. ଏଚ୍. କୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.6 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କାନ କାଟିବା କ୍ଯ଼ାଟର୍ପିଲରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସକାଳେ ରୁଟ ଜୋନ୍ରେ କ୍ୱିନାଲଫସ୍ 25 ଇସି କିମ୍ବା କ୍ଲୋରପାଇରିଫସ୍ 20 ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଆମେରିକୀୟ କୋବ୍ ବୋରରର ସଂକ୍ରମଣକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ 10 ଲିଟର ପାଣି ସହିତ ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC @4 ମିଲି ମିଶାନ୍ତୁ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ହର୍ସ ଗ୍ରାମ୍ ଏବଂ ବେଙ୍ଗଲ ଗ୍ରାମ୍ ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ଅଟେ। ବୁଣିବା ପୂର୍ବରୁ ମଞ୍ଜି ଗୁଡ଼ିକୁ କବକନାଶକ ଏବଂ ରାଇଜୋବିଯ଼ମ୍ ସଂସ୍କୃତି ଦ୍ୱାରା ଚିକିତ୍ସା କରନ୍ତୁ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇବା ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ। ଚାରା ରୋପଣ ପର୍ଯ୍ଯ଼ାଯ଼ରେ କୀଟପତଙ୍ଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଉପଯୁକ୍ତ କିସମର ବ୍ଯ଼ବହାର କରନ୍ତୁ ଏବଂ ନିମ୍ବ ତେଲ ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଆଗାଛା କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣ ପରେ ଏକର ପିଛା ୟୁରିଆ ଏବଂ ଏମଓପି ଲଗାନ୍ତୁ। ଉତ୍ତମ ବୃଦ୍ଧି ପାଇଁ ମଲ୍ଚିଙ୍ଗ ପ୍ରୟୋଗ କରନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ଆବଶ୍ୟକ ପୋଷକ ତତ୍ତ୍ୱ ପ୍ରୟୋଗ କରନ୍ତୁ। ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ କିସମ ଏବଂ ପରିମାଣ ବାଛନ୍ତୁ।"
         ]
      },
      "cabbage": {
         "advisory": [
            "ନର୍ସରୀ ଶଯ୍ଯ଼ା ପ୍ରସ୍ତୁତ କରନ୍ତୁ ଏବଂ ଆବଶ୍ଯ଼କ ପୋଷକ ତତ୍ତ୍ୱ ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ରୋପଣ ପାଇଁ ଉପଯୁକ୍ତ କିସମ ଏବଂ ପରିମାଣ ବାଛନ୍ତୁ।"
         ]
      },
      "ginger": {
         "advisory": [
            "ସମ୍ପୂର୍ଣ୍ଣ ଘାସ କାଟିବା ଏବଂ ଉପର ଡ୍ରେସିଂ। ଉପଯୁକ୍ତ ପଦକ୍ଷେପ ସହିତ ରାଇଜୋମ ପଚନକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ।"
         ]
      },
      "cow": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | କୃମି ଦୂରୀକରଣ ଏବଂ ଆବଶ୍ଯ଼କତା ଅନୁଯାଯ଼ୀ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      },
      "buffalo": {
         "advisory": [
            "ନିର୍ଜଲୀକରଣ, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିୟମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ | କୃମି ଦୂରୀକରଣ ଏବଂ ଆବଶ୍ୟକତା ଅନୁଯାୟୀ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024"
}