{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 8,
         "t_max": 33,
         "t_min": 26,
         "rh_max": 93.9,
         "rh_min": 69.2,
         "wind_speed": 4,
         "wind_direction": 90,
         "cloud_cover": 7
      },
      "31/10/2024": {
         "rainfall": 0.1,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 91.7,
         "rh_min": 67.7,
         "wind_speed": 5,
         "wind_direction": 260.5,
         "cloud_cover": 6
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 91.1,
         "rh_min": 61.3,
         "wind_speed": 6,
         "wind_direction": 261.2,
         "cloud_cover": 6
      },
      "02/11/2024": {
         "rainfall": 0,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 91.5,
         "rh_min": 57.6,
         "wind_speed": 5,
         "wind_direction": 273.6,
         "cloud_cover": 6
      },
      "03/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 24,
         "rh_max": 90.9,
         "rh_min": 51.9,
         "wind_speed": 5,
         "wind_direction": 309.8,
         "cloud_cover": 1
      }
   },
   "names_of_crops": [
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ଯ଼ମୁଖୀ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ଯ଼ମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଗହମ, କଳା ଗହମ, ମଟର, ମଟର, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ଯ଼ମୁଖୀ ଭଳି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। ଦେବୀ (ଆଇ. ସି. ଜି. ଭି. ସି. ଓ.-7, ଧରଣୀ ଇତ୍ଯ଼ାଦି) ଭଳି ଓଡ଼ିଶାର ପରିସ୍ଥିତି ପାଇଁ ଉପଯୁକ୍ତ ଚିନାବାଦାମ କିସମ ବ୍ଯ଼ବହାର କରନ୍ତୁ। ବାଇଗଣ ଏବଂ ଟମାଟୋରେ ୱିଲ୍ଟ ଏବଂ ରଟ୍ ରୋଗକୁ ପରିଚାଳନା କରିବା ପାଇଁ, 10 ଲିଟର ପାଣିରେ ମିଶ୍ରିତ 10 ଗ୍ରାମ୍ ପ୍ଲାଣ୍ଟୋମାଇସିନ୍ ଦ୍ରବଣ ସହିତ ମୂଳ ଅଞ୍ଚଳକୁ ଭିଜାଇ ଦିଅନ୍ତୁ |",
   "crops_data": {
      "paddy": {
         "advisory": [
            "ଫୁଲକୁ ଶାରୀରିକ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼ରେ ପହଞ୍ଚାଇବା-ଏକର ପିଛା 400 ମିଲିଲିଟରରେ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି କିମ୍ବା ଏକର ପିଛା 400 ମିଲିଲିଟରରେ ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି ସିଞ୍ଚନ କରି କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟରପିଲରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ। ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ଯ଼ାରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଗୁଣ୍ଡି ବଗ୍ ମ୍ୟାନେଜମେଣ୍ଟ-କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ମାଲାଥିଅନ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକରକୁ ସକାଳ ସମୟରେ ସମାନ ଭାବରେ ସିଞ୍ଚନ କରି ଗୁଣ୍ଡି ବଗ୍କୁ ନିୟନ୍ତ୍ରଣ କରନ୍ତୁ, ବିନା କିମ୍ବା ସର୍ବନିମ୍ନ ପବନରେ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଫିଜିଓଲୋଜିକାଲ୍ ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼/ଅମଳ ପର୍ଯ୍ଯ଼ାଯ଼-ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ଯ଼ାଗ୍ରେ ଚିନାବାଦାମକୁ ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ ପରି ଡେସିକାଣ୍ଟ ସହିତ 250 ଗ୍ରାମ/30 କିଲୋଗ୍ରାମ ବାକ୍ସରେ ଷ୍ଟୋର୍ କରନ୍ତୁ | 8-10 ଭଣ୍ଡାରଣର ମାସ ପରେ ମଧ୍ଯ଼ ଉଚ୍ଚ ଅଙ୍କୁରୋଦଗମ ହାର ପାଇଁ କୋଠରୀ ତାପମାତ୍ରାରେ ଏକ ଭଲ-ବାଯ଼ୁଚାଳିତ କୋଠରୀରେ ବ୍ଯ଼ାଗକୁ ଲମ୍ବ ଭାବରେ ରଖନ୍ତୁ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ପରିପକ୍ୱତା ପର୍ଯ୍ଯ଼ାଯ଼-ପ୍ରଦତ୍ତ ଛିଦ୍ରରେ ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ 12ଟି ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ଇଣ୍ଟର୍ନୋଡ୍ ଛେଦକକୁ ପରିଚାଳନା କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣ ପାଇଁ ଫିପ୍ରୋନିଲ @600-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.40 ଜିଆର @4 କେଜି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଫଳ ଧାରଣ କରିବା ପର୍ଯ୍ଯ଼ାଯ଼ର ଉଦ୍ଭିଦ-ପାଣିରେ ଗୁଡ଼ ଏବଂ ଡି. ଡି. ଭି. ପି. ସହିତ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରି ଫଳ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ। ଫଳ ମାଛିମାନେ ଚାରା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ସେମାନଙ୍କୁ ହତ୍ଯ଼ା କରାଯିବ।"
         ]
      },
      "cole crop": {
         "advisory": [
            "ଉଦ୍ଭିଦଗତ ପର୍ଯ୍ଯ଼ାଯ଼-ସର୍ବୋତ୍ତମ ବୃଦ୍ଧି ଏବଂ ଦହି ଗଠନ ପାଇଁ ସାର ପ୍ରଯ଼ୋଗ ଏବଂ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସ୍ପ୍ରେ ପରିଚାଳନା କରନ୍ତୁ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ରୋଜରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପାଣିରେ ୱେଟେବଲ୍ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "general": {
         "advisory": [
            "କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟରପିଲର-କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟର୍ପିଲରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ଯ଼ାରେ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଗୁଣ୍ଡି ବଗ୍ ମ୍ୟାନେଜମେଣ୍ଟ-ଗୁଣ୍ଡି ବଗ୍ ସ୍ପ୍ରେକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ମାଲାଥିଅନ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର ସକାଳ ସମୟରେ ସମାନ ଭାବରେ ବିନା କିମ୍ବା ସର୍ବନିମ୍ନ ପବନରେ |",
            "ଚିନାବାଦାମ ଷ୍ଟୋରେଜ୍-ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ଯ଼ାଗ୍ରେ ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ ପରି ଡେସିକାଣ୍ଟ ସହିତ 250 ଗ୍ରାମ/30 କିଲୋଗ୍ରାମ ବାକ୍ସରେ ଚିନାବାଦାମ ଷ୍ଟୋର୍ କରନ୍ତୁ | 8-10 ସଂରକ୍ଷଣର ମାସ ପରେ ମଧ୍ଯ଼ ଉଚ୍ଚ ଅଙ୍କୁରୋଦଗମ ହାର ପାଇଁ କୋଠରୀ ତାପମାତ୍ରାରେ ଏକ ଭଲ-ବାଯ଼ୁଚାଳିତ କୋଠରୀରେ ବ୍ଯ଼ାଗକୁ ଲମ୍ବ ଭାବରେ ରଖନ୍ତୁ |",
            "ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ପରିଚାଳନା-ପ୍ରଦତ୍ତ ଛିଦ୍ରରେ ପ୍ରତ୍ୟେକ କାର୍ଡକୁ 12ଟି ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ପରିଚାଳନା କରନ୍ତୁ। ରାସାୟନିକ ନିୟନ୍ତ୍ରଣ ପାଇଁ ଫିପ୍ରୋନିଲ @600-ମିଲି/ଏକର କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.40 ଜିଆର @4 କେଜି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ଫଳ ମାଛି ପରିଚାଳନା-ପାଣିରେ ଗୁଡ଼ ଏବଂ ଡି. ଡି. ଭି. ପି. ସହିତ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରି କାକୁଡ଼ିରେ ଫଳ ମାଛି ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ। ଫଳ ମାଛିମାନେ ଚାରା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ସେମାନଙ୍କୁ ହତ୍ଯ଼ା କରାଯିବ।",
            "ସାର ପରିଚାଳନା-ସର୍ବୋତ୍ତମ ବୃଦ୍ଧି ଏବଂ ଉତ୍ପାଦନ ପାଇଁ ଏକର ପିଛା ଯ଼ୁରିଆ ଏବଂ ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ। ଉନ୍ନତ ଫଳାଫଳ ପାଇଁ ପ୍ରତିରୋପଣ ପରେ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ବୋରନ ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ ନିଯ଼ନ୍ତ୍ରଣ-ମାରିଗୋଲ୍ଡ ଏବଂ ରୋଜରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପାଣିରେ ୱେଟେବଲ୍ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇ. ସି. ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024"
}