{
   "weather_details": {
      "30-10-2024": {
         "rainfall": 8,
         "t_max": 32,
         "t_min": 22,
         "rh_max": 96,
         "rh_min": 62,
         "wind_speed": 3,
         "wind_direction": 207,
         "cloud_cover": 7
      },
      "31-10-2024": {
         "rainfall": 2,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 95,
         "rh_min": 59,
         "wind_speed": 2,
         "wind_direction": 207,
         "cloud_cover": 6
      },
      "01-11-2024": {
         "rainfall": 1,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 94,
         "rh_min": 54,
         "wind_speed": 2,
         "wind_direction": 211,
         "cloud_cover": 5
      },
      "02-11-2024": {
         "rainfall": 0,
         "t_max": 32,
         "t_min": 21,
         "rh_max": 91,
         "rh_min": 48,
         "wind_speed": 2,
         "wind_direction": 166,
         "cloud_cover": 4
      },
      "03-11-2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 22,
         "rh_max": 86,
         "rh_min": 40,
         "wind_speed": 2,
         "wind_direction": 81,
         "cloud_cover": 4
      }
   },
   "names_of_crops": [
      "ଚାଉଳ",
      "ମକା",
      "ଡାଲିଗୁଡ଼ିକ",
      "ସୋରିଷ",
      "ହଳଦୀ",
      "ଫୁଲକୋବି",
      "କଦଳୀ",
      "ଅଦା।",
      "ଗାଈ ଏବଂ ମଇଁଷି"
   ],
   "general_advisory": "ପାଞ୍ଚ ଦିନର ପାଣିପାଗ ପୂର୍ବାନୁମାନ ଆଧାରରେ, କୃଷକମାନେ ଆନ୍ତଃସାଂସ୍କୃତିକ କାର୍ଯ୍ଯ଼କଳାପ, ପରିପକ୍ୱ ଉତ୍ପାଦ ଅମଳ ଜାରି ରଖିପାରିବେ ଏବଂ ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ଏକ ଷ୍ଟିକର ସହିତ ମିଶ୍ରିତ କୀଟନାଶକ ପ୍ରଯ଼ୋଗ କରିପାରିବେ। ରବି ଫସଲ ପାଇଁ କ୍ଷେତ ପ୍ରସ୍ତୁତି ଆରମ୍ଭ କରାଯିବା ଉଚିତ। ବିଭିନ୍ନ କୀଟପତଙ୍ଗର ପ୍ରକୋପ ଜାଣିବା ଏବଂ ନିଯ଼ନ୍ତ୍ରଣ ରଣନୀତି ଆରମ୍ଭ କରିବା ପାଇଁ ସମସ୍ତ ଫସଲରେ ନିଯ଼ମିତ ତଦାରଖ କାର୍ଯ୍ଯ଼ କରାଯିବା ଉଚିତ।",
   "crops_data": {
      "rice": {
         "advisory": [
            "ନେକ୍ ବ୍ଲାସ୍ଟ୍ ରୋଗ ପରିଚାଳନା ପାଇଁ ଟ୍ରାଇସାଇକ୍ଲାଜୋଲ୍ (ବିମ୍) @0.6 ଗ୍ରାମ୍/ଲିଟର ପାଣି (120 ଗ୍ରାମ୍/ଏସି) ଲଗାନ୍ତୁ।",
            "ବାଷ୍ପ ଛେଦକ ଏବଂ ପତ୍ର ଫୋଲଡରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଓଫସ୍/ପ୍ରୋଫେନୋଫସ୍ @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "ବି. ପି. ଏଚ୍. କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ଇମିଡାକ୍ଲୋପ୍ରିଡ୍ @0.6 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।",
            "କାନ କାଟିବା କ୍ୟାଟର୍ପିଲାରକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, ସକାଳେ ରୁଟ ଜୋନରେ ଏକର ପିଛା 400 ମିଲିମିଟରରେ କ୍ୱିନାଲଫସ୍ 25 ଇସି କିମ୍ବା ଏକର ପିଛା 500 ମିଲିମିଟରରେ କ୍ଲୋରପିରିଫସ୍ 20 ଇସି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "maize": {
         "advisory": [
            "ଆମେରିକୀଯ଼ କୋବ୍ ବୋରର୍ ସଂକ୍ରମଣ ପାଇଁ, ଫ୍ଲୁବେଣ୍ଡିଆମାଇଡ୍ 39.35% SC @4 ମିଲି 10 ଲିଟର ପାଣି ସହିତ ମିଶାନ୍ତୁ।"
         ]
      },
      "pulses": {
         "advisory": [
            "ବର୍ତ୍ତମାନର ପାଣିପାଗ ହର୍ସ ଗ୍ରାମ୍ ଏବଂ ବେଙ୍ଗଲ ଗ୍ରାମ୍ ବୁଣିବା ପାଇଁ ଅନୁକୂଳ ଅଟେ।"
         ]
      },
      "mustard": {
         "advisory": [
            "ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଲାଭ ଉଠାନ୍ତୁ ଏବଂ ସର୍ବୋତ୍ତମ ଉତ୍ପାଦନ ପାଇଁ ଜମି ପ୍ରସ୍ତୁତି ଏବଂ ଫସଲ ବୁଣିବା ଆରମ୍ଭ କରନ୍ତୁ।",
            "ଉପଯୁକ୍ତ କିସମଃ ତୋରିଆ-ଅନୁରାଧା, ପାର୍ବତୀ, ସୁଶ୍ରୀ, ଭାରତୀଯ଼ ସୋରିଷ-ପୁସା ବୋଲ୍ଡ, ପୁସା ଜଯ଼ କିଷାନ। ବୀଜ ହାର-8-10 କିଲୋଗ୍ରାମ/ହେକ୍ଟର, ବ୍ଯ଼ବଧାନ-30 ସେ. ମି. x 10 ସେ. ମି.।",
            "ଚାରା ରୋପଣ ପର୍ଯ୍ୟାୟରେ ସୋରିଷ ଏବଂ ତୋରିଆରେ କୀଟପତଙ୍ଗକୁ ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ ନିମ୍ବ ତେଲ 5 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      },
      "turmeric": {
         "advisory": [
            "ଘାସ କାଟିବା ପାଇଁ ଯାଆନ୍ତୁ ଏବଂ ରୋପଣର 90 ଦିନ ପରେ ଏକର ପିଛା 26 କି. ଗ୍ରା. ଯ଼ୁରିଆ ଏବଂ 30 କି. ଗ୍ରା. ଏମ୍. ଓ. ପି. ଲଗାନ୍ତୁ ଏବଂ ଏକର ପିଛା 2 ଟନ୍ ହାରରେ ମଲ୍ଚିଙ୍ଗ୍ ଲଗାନ୍ତୁ।"
         ]
      },
      "cauliflower": {
         "advisory": [
            "ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ସହିତ ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ସ୍ୱଚ୍ଛ ପାଗ ସମୟରେ ଫୁଲକୋବିର ପରିପକ୍ୱ ଚାରା ଉଠାଯାଇଥିବା ଶଯ୍ୟାରେ ରୋପଣ କରନ୍ତୁ।",
            "ଫୁଲକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମର ତାଲିକା।",
            "କୀଟପତଙ୍ଗ ପାଇଁ ନିଯ଼ମିତ ଭାବରେ ଫୁଲକୋବି ଫସଲ ଉପରେ ନଜର ରଖନ୍ତୁ |"
         ]
      },
      "cabbage": {
         "advisory": [
            "ଭଲ ଭାବେ ଅପଘଟିତ ଏଫ୍. ୱାଇ. ଏମ୍. ଏବଂ କ୍ଲୋରପାଇରିଫୋସ୍ ଧୂଳି ସହିତ ନର୍ସରୀ ଶଯ୍ୟା ପ୍ରସ୍ତୁତ କରନ୍ତୁ।",
            "ବନ୍ଧାକୋବି ପାଇଁ ଉପଯୁକ୍ତ କିସମର ତାଲିକା।"
         ]
      },
      "ginger": {
         "advisory": [
            "3ଯ଼ ଘାସ କାଟିବା ଏବଂ 3ଯ଼ ଉପର ଡ୍ରେସିଂ ସମ୍ପୂର୍ଣ୍ଣ କରନ୍ତୁ।",
            "ରାଇଜୋମ କ୍ଷଯ଼କୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ ସୁପାରିସ କରାଯାଇଥିବା ଉତ୍ପାଦ ସହିତ ମୃତ୍ତିକାକୁ ଭିଜାଇ ଦିଅନ୍ତୁ।",
            "କ୍ଷେତରୁ ସଂକ୍ରମିତ ଗଛଗୁଡ଼ିକୁ ବାହାର କରିଦିଅନ୍ତୁ।"
         ]
      },
      "cow and buffalo": {
         "advisory": [
            "ଡିହାଇଡ୍ରେସନ୍, ଉତ୍ତାପ ଚାପ ଏବଂ ପରଜୀବୀ ସଂକ୍ରମଣର ଲକ୍ଷଣ ପାଇଁ ନିୟମିତ ଭାବରେ ପଶୁମାନଙ୍କୁ ଯାଞ୍ଚ କରନ୍ତୁ |",
            "ଆବଶ୍ଯ଼କ ଅନୁଯାଯ଼ୀ ପଶୁମାନଙ୍କୁ କୃମି ମୁକ୍ତ କରନ୍ତୁ ଏବଂ ସେମାନଙ୍କୁ ସାଧାରଣ ରୋଗ ବିରୁଦ୍ଧରେ ଟୀକାକରଣ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024"
}