{
   "weather_details": {
      "30/10/2024": {
         "rainfall": 3,
         "t_max": 34,
         "t_min": 25,
         "rh_max": 90.4,
         "rh_min": 67.6,
         "wind_speed": 3,
         "wind_direction": 346,
         "cloud_cover": 6
      },
      "31/10/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 88.8,
         "rh_min": 60.4,
         "wind_speed": 4,
         "wind_direction": 240.9,
         "cloud_cover": 6
      },
      "01/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 87.6,
         "rh_min": 53.6,
         "wind_speed": 5,
         "wind_direction": 255.1,
         "cloud_cover": 5
      },
      "02/11/2024": {
         "rainfall": 0,
         "t_max": 33,
         "t_min": 25,
         "rh_max": 88.8,
         "rh_min": 60.4,
         "wind_speed": 6,
         "wind_direction": 327.6,
         "cloud_cover": 5
      }
   },
   "names_of_crops": [
      "ସବୁଜ ଚଣା",
      "କଳା ଚଣା",
      "କଦଳୀ",
      "କ୍ଷେତ ମଟର",
      "ମସୁର ଡାଲି",
      "ଚିନାବାଦାମ",
      "ତୋରିଆ",
      "ସୂର୍ଯ୍ୟମୁଖୀ",
      "ଧାନ।",
      "ବାଇଗଣ",
      "ଟମାଟୋ",
      "ଆଖୁ",
      "କାକୁଡ଼ି",
      "କୋଇଲା ଫସଲ (ଫୁଲକୋବି ଏବଂ ବନ୍ଧାକୋବି)",
      "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ"
   ],
   "general_advisory": "କ୍ଷେତରେ ଉପଲବ୍ଧ ମୃତ୍ତିକା ଆର୍ଦ୍ରତାର ଉପଯୋଗ କରି ମଧ୍ଯ଼ମ/ଅଗଭୀର ତଳିଆ ଅଞ୍ଚଳରେ ସବୁଜ ଚଣା, କଳା ଚଣା, କାଉପି, ଫିଲ୍ଡ ମଟର, ମସୁର ଡାଲି, ଚିନାବାଦାମ, ତୋରିଆ ଏବଂ ସୂର୍ଯ୍ଯ଼ମୁଖୀ ପରି ସ୍ୱଳ୍ପକାଳୀନ ରବି ଫସଲ ଚାଷ କରିବାକୁ କୃଷକମାନଙ୍କୁ ପରାମର୍ଶ ଦିଆଯାଇଛି। କୀଟ ସଂକ୍ରମଣ ରୋକିବା ପାଇଁ କୃଷକମାନଙ୍କୁ ନିଯ଼ମିତ ଭାବେ ନିଜ ଫସଲ କ୍ଷେତ ପରିଦର୍ଶନ କରିବାକୁ ପରାମର୍ଶ ଦିଆଯାଇଛି।",
   "crops_data": {
      "paddy": {
         "advisory": [
            "କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟର୍ପିଲର-କାନ ମୁଣ୍ଡ କ୍ଯ଼ାଟର୍ପିଲରକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ କ୍ଲୋରପିରିଫସ୍ 50 ପ୍ରତିଶତ + ସାଇପର୍ମେଥ୍ରିନ 5 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ପ୍ରୋଫେନୋଫସ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। ଯେହେତୁ କୀଟ ଆଚରଣରେ ନିଶାଚର, ଉତ୍ତମ ଫଳାଫଳ ପାଇଁ ସନ୍ଧ୍ଯ଼ାରେ କୀଟନାଶକ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ୍ |",
            "ଗୁଣ୍ଡି ବଗ ପରିଚାଳନା-ଗୁଣ୍ଡି ବଗକୁ ନିଯ଼ନ୍ତ୍ରଣ କରିବା ପାଇଁ, 200 ଲିଟର ପାଣିରେ ମିଶ୍ରଣ କରି କ୍ଲୋରପିରିଫସ୍ 20 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର କିମ୍ବା ମାଲାଥିଅନ୍ 50 ପ୍ରତିଶତ ଇସି @400 ମିଲି/ଏକର ସ୍ପ୍ରେ କରନ୍ତୁ। କ୍ଲୋରପିରିଫସ୍ 1.5% ଡି @ଏକର ପିଛା 10 କି. ଗ୍ରା. କିମ୍ବା ମାଲାଥିଅନ୍ 5% ଡି. ପି. @ଏକର ପିଛା 10 କି. ଗ୍ରା. ସକାଳ ସମଯ଼ରେ ସମାନ ଭାବରେ କରାଯିବା ଉଚିତ ଯେତେବେଳେ କୌଣସି କିମ୍ବା ସର୍ବନିମ୍ନ ପବନ ନଥାଏ |"
         ]
      },
      "groundnut": {
         "advisory": [
            "ଷ୍ଟୋରେଜ୍-ଚିନାବାଦାମକୁ ପଲିଥିନ୍ ଲାଇନ୍ ହୋଇଥିବା ଗନ୍ନୀ ବ୍ଯ଼ାଗରେ ଫିଉଜଡ୍ କ୍ଯ଼ାଲସିଯ଼ମ୍ କ୍ଲୋରାଇଡ୍ ପରି ଡେସିକାଣ୍ଟ ସହିତ 250 ଗ୍ରାମ/30 କେଜି ମଞ୍ଜି ସହିତ ସଂରକ୍ଷଣ କରାଯିବା ଉଚିତ୍ | ସିଲ୍ ହୋଇଥିବା ବ୍ଯ଼ାଗଗୁଡିକ କୋଠରୀର ତାପମାତ୍ରାରେ ଏକ ଭଲ ବାଯ଼ୁଚାଳିତ କୋଠରୀ ଭିତରେ ଉଲ୍ଲମ୍ବ ଭାବରେ ରଖିବା ଉଚିତ୍ |"
         ]
      },
      "sugarcane": {
         "advisory": [
            "ଇଣ୍ଟର୍ନୋଡ୍ ବୋରର୍ ମ୍ଯ଼ାନେଜମେଣ୍ଟ-କୀଟକୁ ପରିଚାଳନା କରିବା ପାଇଁ, ପ୍ରଦତ୍ତ ଛିଦ୍ରରେ ପ୍ରତ୍ଯ଼େକ କାର୍ଡକୁ 12 ଖଣ୍ଡରେ ବିଭକ୍ତ କରି ସାପ୍ତାହିକ ବ୍ଯ଼ବଧାନରେ 6 ଥର ପାଇଁ ଟ୍ରାଇକୋଗ୍ରାମ ଚିଲିନିସ୍ କାର୍ଡ @1/ଏକର ସହିତ ଜୈବିକ ନିଯ଼ନ୍ତ୍ରଣ କରନ୍ତୁ। ରାସାଯ଼ନିକ ନିଯ଼ନ୍ତ୍ରଣରେ 200 ଲିଟର ପାଣିରେ ମିଶାଇ ଫିପ୍ରୋନିଲ @ଏକର ପିଛା 600 ମିଲି କିମ୍ବା କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @ଏକର ପିଛା 4 କେଜି ସିଞ୍ଚନ କରାଯାଇଥାଏ। ଏହାବ୍ଯ଼ତୀତ, 8 କିଲୋଗ୍ରାମ ବାଲି ସହିତ ମିଶ୍ରଣ କରି କ୍ଲୋରାଣ୍ଟ୍ରାନିଲିପ୍ରୋଲ 0.4 ଜିଆର @4 କିଲୋଗ୍ରାମ/ଏକର ଲଗାନ୍ତୁ।"
         ]
      },
      "cucurbits": {
         "advisory": [
            "ଫଳ ମାଛି-କାକୁଡ଼ିରେ ଫଳ ମାଛି ନିୟନ୍ତ୍ରଣ କରିବା ପାଇଁ, 4 ଲିଟର ପାଣିରେ 400 ଗ୍ରାମ ଗୁଡ଼ ଏବଂ 8 ମିଲି ଡି. ଡି. ଭି. ପି. ମିଶାଇ ଏକ ବିଷାକ୍ତ ଚାରା ପ୍ରସ୍ତୁତ କରନ୍ତୁ। ଏହି ମିଶ୍ରଣକୁ ପ୍ଲାଷ୍ଟିକ୍ କପ୍ କିମ୍ବା ମାଟି ପାତ୍ର @80 ନମ୍ବର/ଏକରରେ ରଖନ୍ତୁ। ଫଳ ମାଛିମାନେ ଏହା ପ୍ରତି ଆକର୍ଷିତ ହେବେ ଏବଂ ଶେଷରେ ବିଷ ଜାଲରେ ପଡ଼ି ମୃତ୍ୟୁବରଣ କରିବେ।"
         ]
      },
      "cole crop (cauliflower and cabbage)": {
         "advisory": [
            "ସାର ପରିଚାଳନା-ଏକର ପିଛା 20 ଡିଏଟି ଏବଂ 33 କେଜି ଯ଼ୁରିଆ ଏବଂ 23 କେଜି ଏମଓପି ପ୍ରଯ଼ୋଗ କରନ୍ତୁ ଏବଂ 15-20 ଡିଏଟିରେ ହାତ କାଟିବା ପରେ। ଯଦି ଚାରା ରୋପଣ ସମଯ଼ରେ ବୋରାକ୍ସ ପ୍ରଯ଼ୋଗ କରାଯାଇନଥାଏ, ତେବେ ବୋରାକ୍ସ @4 କିଲୋଗ୍ରାମ/ଏକର କିମ୍ବା ଫୋଲିବୋର/ସଲ୍ଯ଼ୁବର @1.5 ଗ୍ରାମ/ଲିଟର ସ୍ପ୍ରେ କରନ୍ତୁ। ପ୍ରତିରୋପଣର ଦୁଇ ସପ୍ତାହ ପରେ ଏବଂ ଦହି ତିଆରି ହେବାର ଦୁଇ ସପ୍ତାହ ପୂର୍ବରୁ ବୋରନ ମାଇକ୍ରୋ ନ୍ଯ଼ୁଟ୍ରିଏଣ୍ଟ ସିଞ୍ଚନ କରାଯିବା ଉଚିତ।"
         ]
      },
      "marigold & rose": {
         "advisory": [
            "ମାରିଗୋଲ୍ଡ ଏବଂ ଗୋଲାପ ପରି ଫୁଲରେ ରେଡ୍ ସ୍ପାଇଡର ମାଇଟ୍କୁ ପରିଚାଳନା କରିବା ପାଇଁ, ୱେଟେବଲ୍ ସଲଫର୍ 80 ପ୍ରତିଶତ ଡବ୍ଲ୍ଯ଼ୁ. ପି. @2 ଗ୍ରାମ/ଲିଟର ପାଣି କିମ୍ବା ପ୍ରୋପାର୍ଜାଇଟ୍ 57 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି କିମ୍ବା ଫେନପାଇରୋକ୍ସିମେଟ୍ 5 ପ୍ରତିଶତ ଇ. ସି. @2 ମିଲି/ଲିଟର ପାଣି ସ୍ପ୍ରେ କରନ୍ତୁ।"
         ]
      }
   },
   "date": "29-10-2024"
}